{
  "id": "doc-001",
  "title": "인공지능기술이 적용된 디지털의료기기의 허가·심사 가이드라인(민원인 안내서)",
  "summary": "This guideline provides criteria for classification, approval, and review methods for digital medical devices incorporating artificial intelligence technology, specifically for machine learning-enabled medical devices (MLMD).",
  "page_ref": "3-15",
  "children": [
    {
      "id": "chap-I",
      "title": "Ⅰ. 일반사항",
      "summary": "This chapter introduces the background, purpose, scope, definitions, and characteristics of digital medical devices with AI technology.",
      "page_ref": "3-6",
      "children": [
        {
          "id": "sec-I-1",
          "title": "1. 배경 및 목적",
          "summary": "Explains AI and Machine Learning, defines MLMD, and states the guideline's purpose to provide transparent approval/review methods based on relevant laws for MLMDs.",
          "page_ref": "3"
        },
        {
          "id": "sec-I-2",
          "title": "2. 적용 범위",
          "summary": "Applies to MLMDs that analyze medical data for purposes aligned with the Digital Medical Products Act, including standalone and embedded digital medical device software.",
          "page_ref": "4"
        },
        {
          "id": "sec-I-3",
          "title": "3. 용어 정의 및 설명",
          "summary": "Provides definitions for key terms related to AI-powered digital medical devices.",
          "page_ref": "4-5",
          "children": [
            {
              "id": "art-I-3-a",
              "title": "가. 기계학습가능 의료기기",
              "summary": "Digital medical devices that use machine learning, in part or whole, to achieve their intended medical purpose.",
              "page_ref": "4"
            },
            {
              "id": "art-I-3-b",
              "title": "나. 인공지능",
              "summary": "Computer programming that mimics human abilities like language understanding, object/sound recognition, learning, and problem-solving using logic, decision trees, machine learning, or deep learning.",
              "page_ref": "4"
            },
            {
              "id": "art-I-3-c",
              "title": "다. 의료용 데이터",
              "summary": "Various medical information used to diagnose, manage, or predict diseases, such as medical records, biometric information from medical devices, medical images, and genetic information.",
              "page_ref": "4"
            },
            {
              "id": "art-I-3-d",
              "title": "라. 훈련",
              "summary": "A procedure to build or improve ML model parameters based on ML training algorithms using training data.",
              "page_ref": "4"
            },
            {
              "id": "art-I-3-e",
              "title": "마. 훈련 데이터셋",
              "summary": "A collection of data used for training an ML model, independent of the test dataset.",
              "page_ref": "4"
            },
            {
              "id": "art-I-3-f",
              "title": "바. 참조표준",
              "summary": "An objectively defined criterion used as an expected outcome for comparison, evaluation, or training.",
              "page_ref": "5"
            },
            {
              "id": "art-I-3-g",
              "title": "사. 편향",
              "summary": "A systematic difference in the treatment of a specific object, person, or group compared to a control group, encompassing perception, observation, representation, prediction, or decision.",
              "page_ref": "5"
            },
            {
              "id": "art-I-3-h",
              "title": "아. 시험 데이터셋",
              "summary": "A collection of data used to evaluate the performance of an ML model after training, not exposed to the ML training algorithm during training.",
              "page_ref": "5"
            }
          ]
        },
        {
          "id": "sec-I-4",
          "title": "4. 제품 특성",
          "summary": "Describes MLMDs as utilizing machine learning to derive disease features from medical data, allowing for real-time algorithm changes and cloud computing for data storage and use.",
          "page_ref": "6"
        }
      ]
    },
    {
      "id": "chap-II",
      "title": "Ⅱ. 의료기기 구분기준 및 품목분류",
      "summary": "This chapter outlines the criteria for classifying digital medical devices and their product categories, including regulatory approaches and examples.",
      "page_ref": "6-15",
      "children": [
        {
          "id": "sec-II-1",
          "title": "1. 개요",
          "summary": "States the purpose of evaluating the need for managing ML-based software as digital medical devices and providing classification criteria and management plans.",
          "page_ref": "6"
        },
        {
          "id": "sec-II-2",
          "title": "2. 인공지능기술이 적용된 의료 소프트웨어에 대한 규제적 접근",
          "summary": "Emphasizes a flexible regulatory approach for ML-based medical software, focusing on managing software that clearly meets the definition of a digital medical device or poses patient risk if not functioning as intended.",
          "page_ref": "7"
        },
        {
          "id": "sec-II-3",
          "title": "3. 디지털의료기기 판단기준",
          "summary": "Defines digital medical devices based on the Digital Medical Products Act, focusing on advanced technologies and specific medical purposes, and outlines criteria for determining if ML-based software qualifies.",
          "page_ref": "7-9",
          "children": [
            {
              "id": "art-II-3-a",
              "title": "가. 소프트웨어가 의도한 대로 작동하지 않아 환자에게 위해를 끼칠 가능성이 있는지 여부",
              "summary": "Evaluates the potential for patient harm if medical software operates inaccurately, leading to incorrect diagnoses or treatments due to faulty data or algorithms.",
              "page_ref": "9"
            },
            {
              "id": "art-II-3-b",
              "title": "나. 소프트웨어가 의료인의 임상적 판단을 보장하는지 여부",
              "summary": "Assesses whether the software allows medical professionals to verify its accuracy and reliability, ensuring they are not solely dependent on unverified information for clinical decisions.",
              "page_ref": "9-10"
            }
          ]
        },
        {
          "id": "sec-II-4",
          "title": "4. 구체적인 범위 및 예시",
          "summary": "Provides specific examples of software classified as digital medical devices, those exempt from manufacturing approval, and those not considered digital medical devices.",
          "page_ref": "10-14",
          "children": [
            {
              "id": "art-II-4-a",
              "title": "가. 디지털의료기기에 해당하는 소프트웨어",
              "summary": "Software that analyzes medical data (e.g., images, signals) to provide clinical information for diagnosis, treatment, or prognosis, or automatically diagnoses, predicts, monitors, or treats diseases based on analyzed medical information.",
              "page_ref": "10-11"
            },
            {
              "id": "art-II-4-b",
              "title": "나. 제조업허가 등의 제외 대상에 해당하는 디지털의료기기소프트웨어",
              "summary": "Software supporting licensed medical professionals' duties, such as electronic medical record management, data transmission/storage/conversion/display, or collection/processing/analysis of clinically/academically verified health information, unless posing significant patient harm.",
              "page_ref": "12-13"
            },
            {
              "id": "art-II-4-c",
              "title": "다. 디지털의료기기에 해당하지 않는 소프트웨어",
              "summary": "Software for administrative tasks, exercise/leisure/daily health management, or educational/research purposes.",
              "page_ref": "13-14"
            }
          ]
        },
        {
          "id": "sec-II-5",
          "title": "5. 디지털의료기기에 해당하지 않는 소프트웨어 관리방안",
          "summary": "Describes the Ministry of Food and Drug Safety's approach to continuously review and potentially reclassify software not currently considered digital medical devices if risk factors are identified, involving stakeholder discussions.",
          "page_ref": "15"
        }
      ]
    },
    {
      "id": "chap-III",
      "title": "Ⅲ. 허가·심사 방안",
      "summary": "This chapter details the considerations for approval and review of MLMDs, including application content, verification items, clinical efficacy, required documents, change approvals, and training dataset management.",
      "page_ref": "15-24",
      "children": [
        {
          "id": "sec-III-1",
          "title": "1. 신청서의 ‘성능(기능) 또는 특성’ 기재 방법",
          "summary": "Specifies additional information required in MLMD applications, including clinical performance, main functions of sub-programs, specific digital technology characteristics, training data information, update cycles, and cloud service details.",
          "page_ref": "16-17",
          "children": [
            {
              "id": "art-III-1-a",
              "title": "가. 학습데이터의 정보",
              "summary": "Requires details on the collection period, institutions, sectors, and scale of training data.",
              "page_ref": "17"
            },
            {
              "id": "art-III-1-b",
              "title": "나. 학습데이터의 업데이트 예상 주기",
              "summary": "Requires stating the expected frequency of training data updates by the manufacturer.",
              "page_ref": "17"
            },
            {
              "id": "art-III-1-c",
              "title": "다. 제3자가 제공하는 클라우드 서비스를 통해 개발ㆍ구현된 경우에는 클라우드의 서비스의 종류 및 구성 형태",
              "summary": "Requires specifying the type and configuration of cloud services used if the product is developed or implemented through third-party cloud providers.",
              "page_ref": "17"
            }
          ]
        },
        {
          "id": "sec-III-2",
          "title": "2. 성능 및 임상적 유효성 검증 항목",
          "summary": "Outlines key metrics like sensitivity, specificity, positive/negative predictive value, and AUC for verifying the diagnostic accuracy and clinical efficacy of MLMDs, emphasizing independent test datasets.",
          "page_ref": "18",
          "children": [
            {
              "id": "art-III-2-1",
              "title": "1) 민감도 (Sensitivity)",
              "summary": "The probability of correctly classifying individuals with a specific disease as having that disease.",
              "page_ref": "18"
            },
            {
              "id": "art-III-2-2",
              "title": "2) 특이도 (Specificity)",
              "summary": "The probability of correctly classifying individuals without a specific disease as not having that disease.",
              "page_ref": "18"
            },
            {
              "id": "art-III-2-3",
              "title": "3) 양성 예측도 (Positive Predictive Value)",
              "summary": "The proportion of individuals classified as having a specific characteristic who actually possess that characteristic.",
              "page_ref": "18"
            },
            {
              "id": "art-III-2-4",
              "title": "4) 음성 예측도 (Negative Predictive Value)",
              "summary": "The proportion of individuals classified as not having a specific characteristic who actually do not possess that characteristic.",
              "page_ref": "18"
            },
            {
              "id": "art-III-2-5",
              "title": "5) AUC (Area Under the Curve)",
              "summary": "The area under the ROC (Receiver Operating Characteristic) Curve, indicating diagnostic accuracy, with values closer to 1.0 representing ideal performance.",
              "page_ref": "18"
            }
          ]
        },
        {
          "id": "sec-III-3",
          "title": "3. 임상적 유효성 확인",
          "summary": "Discusses methods for confirming clinical efficacy in MLMDs, including prospective, retrospective, and combined studies, emphasizing independent test datasets and bias considerations.",
          "page_ref": "19-20",
          "children": [
            {
              "id": "art-III-3-1",
              "title": "1) 전향적 연구 (Prospective Study)",
              "summary": "A research method that sets factors (risk elements) in advance and tracks changes over a period to observe the changes caused by these factors.",
              "page_ref": "19"
            },
            {
              "id": "art-III-3-2",
              "title": "2) 후향적 연구 (Retrospective Study)",
              "summary": "Research conducted without direct contact with subjects, using previously acquired medical data (e.g., records, images, biosignals) to verify the safety and efficacy of medical devices.",
              "page_ref": "19"
            }
          ]
        },
        {
          "id": "sec-III-4",
          "title": "4. 첨부서류의 범위",
          "summary": "Specifies the attached documents for digital medical device approval applications, particularly requiring detailed information on applied algorithms and verification/validation reports for software, including test dataset collection and methods.",
          "page_ref": "21",
          "children": [
            {
              "id": "art-III-4-1",
              "title": "1) 시험 개요",
              "summary": "Requires details on test dataset collection criteria, methods, and number of datasets.",
              "page_ref": "21"
            },
            {
              "id": "art-III-4-2",
              "title": "2) 시험 방법",
              "summary": "Requires details on reference standard construction criteria and methods, and test items/criteria (e.g., accuracy, precision) with their setting methods and rationale.",
              "page_ref": "21"
            }
          ]
        },
        {
          "id": "sec-III-5",
          "title": "5. 변경허가·인증 대상",
          "summary": "Defines when changes to approved/certified digital medical devices require change approval/certification, particularly for those affecting safety/efficacy, unless covered by a pre-submitted change management plan for AI-powered devices.",
          "page_ref": "22-23",
          "children": [
            {
              "id": "art-III-5-1",
              "title": "1. 디지털의료기기소프트웨어에 대한 다음의 변경",
              "summary": "Changes to digital medical device software that require change approval, including core performance, algorithms, development environment, communication functions affecting cybersecurity, and user interface changes requiring comprehensive evaluation.",
              "page_ref": "22",
              "children": [
                {
                  "id": "art-III-5-1-a",
                  "title": "가. 사용목적 또는 이와 관련된 핵심적인 성능",
                  "summary": "Changes to the intended use or core performance related to it.",
                  "page_ref": "22"
                },
                {
                  "id": "art-III-5-1-b",
                  "title": "나. 생체신호·의료영상과 같은 분석 대상이나 분석기법 등 알고리즘(분석방법)",
                  "summary": "Changes to analysis targets (e.g., biosignals, medical images) or analysis techniques/algorithms.",
                  "page_ref": "22"
                },
                {
                  "id": "art-III-5-1-c",
                  "title": "다. 소프트웨어 개발 언어 또는 운영환경",
                  "summary": "Changes to the software development language or operating environment.",
                  "page_ref": "22"
                },
                {
                  "id": "art-III-5-1-d",
                  "title": "라. 법 제14조에 따른 전자적 침해행위로부터의 보호 조치에 영향을 미치는 통신기능 등",
                  "summary": "Changes to communication functions or similar aspects that affect protection measures against electronic infringement as per Article 14 of the Act.",
                  "page_ref": "22"
                },
                {
                  "id": "art-III-5-1-e",
                  "title": "마. 사용 사양서 또는 사용자 인터페이스의 변경 중 총괄평가(혹은 이와 동등 이상의 평가)를 수반하는 변경",
                  "summary": "Changes to user specifications or the user interface that necessitate a comprehensive evaluation (or equivalent).",
                  "page_ref": "22"
                }
              ]
            },
            {
              "id": "art-III-5-2",
              "title": "2. 의료기기 하드웨어의 변경 중 성능 또는 전기·기계적 안전에 영향을 미치지 않는 해당 지지털의료기기의 외관, 치수, 버튼의 형태 및 위치, 손잡이 등의 변경을 제외한 변경",
              "summary": "Changes to medical device hardware, excluding those related to appearance, dimensions, button shape/position, or handles that do not affect performance or electrical/mechanical safety.",
              "page_ref": "22"
            }
          ]
        },
        {
          "id": "sec-III-6",
          "title": "6. 훈련 데이터셋의 관리",
          "summary": "Emphasizes the need for manufacturers to establish training dataset management policies to ensure consistent validity, defining acquisition plans, operational management systems, and quality control processes, including regular quality assessment of added data.",
          "page_ref": "24"
        }
      ]
    },
    {
      "id": "chap-IV",
      "title": "Ⅳ. 참고문헌",
      "summary": "This chapter lists the reference documents used in the creation of this guideline.",
      "page_ref": "25",
      "children": [
        {
          "id": "sec-IV-1",
          "title": "1. 참고문헌",
          "summary": "Lists various guidelines and standards, including 'Medical Device Software Validation Guideline' (MFDS), IEC 62304, FDA Guidance for Premarket Submissions for Software, ISO 14971, and IEC/TR 24971.",
          "page_ref": "25"
        }
      ]
    }
  ]
}